# -*- coding: utf-8 -*-
"""
===========================================
 @Time    : 2018/5/9 15:26
 @Author  : allinXallin
 @Email   : sa15225038@mail.ustc.edu.cn
 @File    : test.py
 @Software: 哈哈，接受挑战吧！PyCharm 
===========================================
"""



# import time
#
# def consumer():
#     r = ''
#     while True:
#         n = yield r  # yield就是 return 返回一个值，并且记住这个返回的位置，下次迭代就从这个位置后开始。
#         if not n:
#             return '21'
#         print('[CONSUMER]   Consuming %s:..' % n)
#         time.sleep(1)
#         r='200 OK'
#
#
# def produce(consumer):
#     #next(consumer)  # 第一次调用时必须先next()或send(None)，否则会报错,send后之所以为None是因为这时候没有上一个yield(根据第8条)。可以认为，next()等同于send(None)。
#     consumer.send(None)
#     n=0
#     while n<5:
#         n=n+1
#         print('[PRODUCER]   Produceing %s..'%n)
#         r= consumer.send(n)  # send(n)与next()的区别在于send可以传递参数给yield表达式;send(n)与next()都有返回值，它们的返回值是当前迭代遇到yield时，yield后面表达式的值，其实就是当前迭代中yield后面的参数。
#         print('[PRODUCER]    Consumer return: %s' % r)
#     consumer.close()
#
#
# def fun123():
#     yield 1
#     yield 2
#     yield 3
#
# if __name__ == '__main__':
#     c=consumer()
#     produce(c)
#     #
#     # for item in fun123():
#     #     print(item)




from pyecharts import Geo

data = [("七台河", 1), ("三明", 3), ("上海", 25), ("东莞", 29), ("东营", 1), ("中山", 5), ("临汾", 5), ("临沂", 6), ("丹东", 1),
        ("丽江市", 1), ("乌兰察布市", 4), ("乌鲁木齐", 4), ("乐山", 1), ("云浮", 3), ("亳州", 1), ("仙桃", 1), ("佛山", 16), ("保定", 9),
        ("信阳", 4), ("克拉玛依", 1), ("六安", 1), ("北京", 40), ("十堰", 1), ("南京", 10), ("南平", 1), ("南昌", 3), ("南通", 15),
        ("南阳", 9), ("厦门", 2), ("台州", 2), ("合肥", 3), ("吐鲁番", 1), ("吕梁", 6), ("呼和浩特", 1), ("咸宁", 1), ("咸阳", 2),
        ("哈尔滨", 3), ("唐山", 49), ("商洛", 1), ("嘉兴", 1), ("四平", 1), ("固原市", 1), ("大同", 2), ("大理", 1), ("大连", 1), ("天津", 3),
        ("天门", 1), ("太原", 5), ("威海", 14), ("娄底", 17), ("孝感", 1), ("宁波", 2), ("安康", 3), ("安阳", 4), ("宜昌", 2), ("宣城市", 3),
        ("宿州", 3), ("岳阳", 8), ("常州", 12), ("常德", 17), ("平顶山", 2), ("广州", 38), ("廊坊", 4), ("开封", 3), ("张家界", 5),
        ("德州", 13), ("怀化", 9), ("惠州", 64), ("成都", 9), ("扬州", 1), ("承德", 1), ("揭阳", 3), ("新乡", 1), ("新余", 2), ("无锡", 21),
        ("日照", 1), ("昆明", 1), ("晋城", 1), ("本溪", 1), ("来宾市", 1), ("杭州", 7), ("松原", 1), ("枣庄", 6), ("株洲", 10), ("桂林", 11),
        ("梅州", 10), ("榆林", 5), ("武汉", 31), ("永州", 3), ("汉中", 1), ("汕头", 5), ("汕尾", 1), ("江门", 20), ("池州市", 1),
        ("沈阳", 8), ("沧州", 6), ("河源", 1), ("泉州", 2), ("泰安", 8), ("泰州", 10), ("洛阳", 2), ("济南", 19), ("济宁", 8), ("海口", 2),
        ("淄博", 1), ("淮安", 1), ("深圳", 54), ("清远", 1), ("温州", 3), ("渭南", 2), ("湘潭", 5), ("湛江", 1), ("滁州", 1), ("滨州", 3),
        ("漳州", 1), ("潍坊", 2), ("潮州", 7), ("烟台", 4), ("焦作", 5), ("牡丹江", 18), ("玉林", 1), ("珠海", 9), ("白银", 1), ("益阳", 4),
        ("石家庄", 17), ("福州", 14), ("秦皇岛", 1), ("绥化", 2), ("聊城", 4), ("肇庆", 11), ("苏州", 23), ("茂名", 9), ("荆州", 4),
        ("莱芜", 3), ("菏泽", 2), ("萍乡", 3), ("营口", 1), ("蚌埠", 1), ("衡水", 7), ("衡阳", 10), ("襄樊", 1), ("西安", 2), ("许昌", 1),
        ("贵港", 2), ("赣州", 2), ("赤峰", 2), ("运城", 5), ("遵义", 1), ("邢台", 23), ("邯郸", 1), ("邵阳", 2), ("郑州", 20), ("郴州", 7),
        ("鄂尔多斯", 3), ("鄂州", 2), ("重庆", 13), ("钦州", 2), ("锡林郭勒盟", 1), ("镇江", 2), ("长春", 8), ("长沙", 38), ("长治", 3),
        ("防城港", 1), ("阳江", 9), ("阳泉", 1), ("阿拉善盟", 1), ("随州", 1), ("青岛", 66), ("韶关", 14), ("鹤壁", 1), ("鹰潭", 1),
        ("黄冈", 13), ("黄石", 1), ("贵阳", 3), ("龙岩", 3)
        ]

coords={'asd': [116.46, 39.92]}



geo = Geo("喂车全国业务分布", "data from weicheche", title_color="#fff",title_pos="center", width=1000,height=600, background_color='#404a59')

Geo.add_coordinate(geo,"asd", 116.46, 39.92)
attr, value = geo.cast(data)

# geo.add("", attr, value, visual_range=[0, 50], maptype='china',is_label_show=True, visual_text_color="#ff0000",
#         symbol_size=10, is_visualmap=True)
geo.add("", attr, value, visual_range=[0, 50], maptype='china',visual_text_color="#ff0000",geo_normal_color="#fff",
        geo_emphasis_color="#00ff00",
        symbol_size=10, is_visualmap=True)
geo.render()  # 生成html文件






# import pyecharts
#
#
# data = [("七台河", 1), ("三明", 3), ("上海", 25), ("东莞", 29), ("东营", 1), ("中山", 5), ("临汾", 5), ("临沂", 6), ("丹东", 1),
#         ("丽江市", 1), ("乌兰察布市", 4), ("乌鲁木齐", 4), ("乐山", 1), ("云浮", 3), ("亳州", 1), ("仙桃", 1), ("佛山", 16), ("保定", 9),
#         ("信阳", 4), ("克拉玛依", 1), ("六安", 1), ("北京", 40), ("十堰", 1), ("南京", 10), ("南平", 1), ("南昌", 3), ("南通", 15),
#         ("南阳", 9), ("厦门", 2), ("台州", 2), ("合肥", 3), ("吐鲁番", 1), ("吕梁", 6), ("呼和浩特", 1), ("咸宁", 1), ("咸阳", 2),
#         ("哈尔滨", 3), ("唐山", 49), ("商洛", 1), ("嘉兴", 1), ("四平", 1), ("固原市", 1), ("大同", 2), ("大理", 1), ("大连", 1), ("天津", 3),
#         ("天门", 1), ("太原", 5), ("威海", 14), ("娄底", 17), ("孝感", 1), ("宁波", 2), ("安康", 3), ("安阳", 4), ("宜昌", 2), ("宣城市", 3),
#         ("宿州", 3), ("岳阳", 8), ("常州", 12), ("常德", 17), ("平顶山", 2), ("广州", 38), ("廊坊", 4), ("开封", 3), ("张家界", 5),
#         ("德州", 13), ("怀化", 9), ("惠州", 64), ("成都", 9), ("扬州", 1), ("承德", 1), ("揭阳", 3), ("新乡", 1), ("新余", 2), ("无锡", 21),
#         ("日照", 1), ("昆明", 1), ("晋城", 1), ("本溪", 1), ("来宾市", 1), ("杭州", 7), ("松原", 1), ("枣庄", 6), ("株洲", 10), ("桂林", 11),
#         ("梅州", 10), ("榆林", 5), ("武汉", 31), ("永州", 3), ("汉中", 1), ("汕头", 5), ("汕尾", 1), ("江门", 20), ("池州市", 1),
#         ("沈阳", 8), ("沧州", 6), ("河源", 1), ("泉州", 2), ("泰安", 8), ("泰州", 10), ("洛阳", 2), ("济南", 19), ("济宁", 8), ("海口", 2),
#         ("淄博", 1), ("淮安", 1), ("深圳", 54), ("清远", 1), ("温州", 3), ("渭南", 2), ("湘潭", 5), ("湛江", 1), ("滁州", 1), ("滨州", 3),
#         ("漳州", 1), ("潍坊", 2), ("潮州", 7), ("烟台", 4), ("焦作", 5), ("牡丹江", 18), ("玉林", 1), ("珠海", 9), ("白银", 1), ("益阳", 4),
#         ("石家庄", 17), ("福州", 14), ("秦皇岛", 1), ("绥化", 2), ("聊城", 4), ("肇庆", 11), ("苏州", 23), ("茂名", 9), ("荆州", 4),
#         ("莱芜", 3), ("菏泽", 2), ("萍乡", 3), ("营口", 1), ("蚌埠", 1), ("衡水", 7), ("衡阳", 10), ("襄樊", 1), ("西安", 2), ("许昌", 1),
#         ("贵港", 2), ("赣州", 2), ("赤峰", 2), ("运城", 5), ("遵义", 1), ("邢台", 23), ("邯郸", 1), ("邵阳", 2), ("郑州", 20), ("郴州", 7),
#         ("鄂尔多斯", 3), ("鄂州", 2), ("重庆", 13), ("钦州", 2), ("锡林郭勒盟", 1), ("镇江", 2), ("长春", 8), ("长沙", 38), ("长治", 3),
#         ("防城港", 1), ("阳江", 9), ("阳泉", 1), ("阿拉善盟", 1), ("随州", 1), ("青岛", 66), ("韶关", 14), ("鹤壁", 1), ("鹰潭", 1),
#         ("黄冈", 13), ("黄石", 1), ("贵阳", 3), ("龙岩", 3)
#         ]
#
# city = []
# scale = []
# for item in data[:5]:
#         city.append(item[0])
#         scale.append(item[1])
#
#
# page = pyecharts.Page()
# style = pyecharts.Style(width=1300, height=860, background_color='#404a66', title_color="#eee", title_pos="center")
# geo = pyecharts.Geo("油站分布地图", **style.init_style)
# geo.add("", city, scale, visual_text_color="#eee", is_legend_show=False,
#     symbol_size=12, is_visualmap=True, visual_range=[0, 50],
#     tooltip_formatter='{b}',
#     label_emphasis_textsize=15,
#     label_emphasis_pos='right')
# page.add(geo)
# geo.render()






